In [1]:
import pandas as pd
import numpy  as np

In [2]:
df1 = pd.DataFrame([[1,2,3,4] , [5,6,7,8] , [2,7,3,23] , [3,6,8,23] , [23,23,63,12]])
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

# Slicing

In [3]:
df1.shape

(5, 4)

In [4]:
df1.iloc[0,1]

2

In [5]:
df1.iloc[0,2]

3

In [6]:
df1.iloc[3,3]

23

In [7]:
df1.iloc[0:2 ,1:3 ]

   1  2
0  2  3
1  6  7

# Give Headers & Column Name to Data Frame

In [8]:
df2 = pd.DataFrame([[11,22,33,31],[66,39,85,81],[42,67,53,23],[13,46,18,93],[73,2,3,22]] , columns = ['A' , 'B' ,'C' , 'D'])
df2

    A   B   C   D
0  11  22  33  31
1  66  39  85  81
2  42  67  53  23
3  13  46  18  93
4  73   2   3  22

# Give Index OR Row Name to Data Frame

In [9]:
df2 = pd.DataFrame([[11,22,33,31],[66,39,85,81],[42,67,53,23],[13,46,18,93],[73,2,3,22]] , index = ['I','II','III','IV','V' ])
df2

      0   1   2   3
I    11  22  33  31
II   66  39  85  81
III  42  67  53  23
IV   13  46  18  93
V    73   2   3  22

In [10]:
df2 = pd.DataFrame([[11,22,33,31],[66,39,85,81],[42,67,53,23],[13,46,18,93],[73,2,3,22]] , index = ['I','II','III','IV','V' ] , columns=['A' , 'B' , 'C' , 'D'])
df2

      A   B   C   D
I    11  22  33  31
II   66  39  85  81
III  42  67  53  23
IV   13  46  18  93
V    73   2   3  22

In [11]:
df2.shape

(5, 4)

# Drop Row in DataFrame

In [12]:
df2.drop('II')

      A   B   C   D
I    11  22  33  31
III  42  67  53  23
IV   13  46  18  93
V    73   2   3  22

# Drop Column in DataFrame

In [13]:
# df2.drop(['B' , 'C'] , axis=1)
df2.drop(columns = ['B' , 'C'])

      A   D
I    11  31
II   66  81
III  42  23
IV   13  93
V    73  22

In [14]:
df2.drop('C', axis=1)

      A   B   D
I    11  22  31
II   66  39  81
III  42  67  23
IV   13  46  93
V    73   2  22

In [15]:
df2

      A   B   C   D
I    11  22  33  31
II   66  39  85  81
III  42  67  53  23
IV   13  46  18  93
V    73   2   3  22